CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_Basic
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_Basic(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port D Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortD);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA0 (pin 50) is configured as JTAG_TCLK */
    PORT_SetPinMux(RTEPIN_BASIC_SWO_CLK_PORT, RTEPIN_BASIC_SWO_CLK_PIN, kPORT_MuxAlt7);

    /* PORTA11 (pin 63) is configured as PTA11 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_1_PORT, RTEPIN_BASIC_SWITCH_1_PIN, kPORT_MuxAsGpio);

    /* PORTA13 (pin 65) is configured as PTA13 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_2_PORT, RTEPIN_BASIC_SWITCH_2_PIN, kPORT_MuxAsGpio);

    /* PORTA15 (pin 67) is configured as PTA15 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_3_PORT, RTEPIN_BASIC_SWITCH_3_PIN, kPORT_MuxAsGpio);

    /* PORTA18 (pin 72) is configured as EXTAL0 */
    PORT_SetPinMux(PORTA, 18U, kPORT_PinDisabledOrAnalog);

    /* PORTA3 (pin 53) is configured as JTAG_TMS */
    PORT_SetPinMux(RTEPIN_BASIC_SWO_DIO_PORT, RTEPIN_BASIC_SWO_DIO_PIN, kPORT_MuxAlt7);

    /* PORTA5 (pin 55) is configured as JTAG_TRST_b */
    PORT_SetPinMux(RTEPIN_BASIC_RST_PORT, RTEPIN_BASIC_RST_PIN, kPORT_MuxAlt7);

    /* PORTA7 (pin 59) is configured as ADC0_SE10 */
    PORT_SetPinMux(PORTA, 7U, kPORT_PinDisabledOrAnalog);

    /* PORTA8 (pin 60) is configured as ADC0_SE11 */
    PORT_SetPinMux(PORTA, 8U, kPORT_PinDisabledOrAnalog);

    /* PORTA9 (pin 61) is configured as PTA9 */
    PORT_SetPinMux(RTEPIN_BASIC_SWITCH_0_PORT, RTEPIN_BASIC_SWITCH_0_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 81) is configured as FTM1_QD_PHA */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_LA_PORT, RTEPIN_BASIC_ENCO_LA_PIN, kPORT_MuxAlt6);

    /* PORTB1 (pin 82) is configured as FTM1_QD_PHB */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_LB_PORT, RTEPIN_BASIC_ENCO_LB_PIN, kPORT_MuxAlt6);

    /* PORTB18 (pin 97) is configured as FTM2_QD_PHA */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_RA_PORT, RTEPIN_BASIC_ENCO_RA_PIN, kPORT_MuxAlt6);

    /* PORTB19 (pin 98) is configured as FTM2_QD_PHB */
    PORT_SetPinMux(RTEPIN_BASIC_ENCO_RB_PORT, RTEPIN_BASIC_ENCO_RB_PIN, kPORT_MuxAlt6);

    /* PORTC1 (pin 104) is configured as FTM0_CH0 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_RA_PORT, RTEPIN_BASIC_MOTOR_RA_PIN, kPORT_MuxAlt4);

    /* PORTC10 (pin 115) is configured as PTC10 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_2_PORT, RTEPIN_BASIC_CAM_D_2_PIN, kPORT_MuxAsGpio);

    /* PORTC11 (pin 116) is configured as PTC11 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_3_PORT, RTEPIN_BASIC_CAM_D_3_PIN, kPORT_MuxAsGpio);

    /* PORTC12 (pin 117) is configured as PTC12 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_4_PORT, RTEPIN_BASIC_CAM_D_4_PIN, kPORT_MuxAsGpio);

    /* PORTC13 (pin 118) is configured as PTC13 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_5_PORT, RTEPIN_BASIC_CAM_D_5_PIN, kPORT_MuxAsGpio);

    /* PORTC14 (pin 119) is configured as PTC14 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_6_PORT, RTEPIN_BASIC_CAM_D_6_PIN, kPORT_MuxAsGpio);

    /* PORTC15 (pin 120) is configured as PTC15 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_7_PORT, RTEPIN_BASIC_CAM_D_7_PIN, kPORT_MuxAsGpio);

    /* PORTC16 (pin 123) is configured as UART3_RX */
    PORT_SetPinMux(PORTC, 16U, kPORT_MuxAlt3);

    /* PORTC17 (pin 124) is configured as UART3_TX */
    PORT_SetPinMux(PORTC, 17U, kPORT_MuxAlt3);

    /* PORTC18 (pin 125) is configured as PTC18 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_PCLK_PORT, RTEPIN_BASIC_CAM_PCLK_PIN, kPORT_MuxAsGpio);

    /* PORTC2 (pin 105) is configured as FTM0_CH1 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_RB_PORT, RTEPIN_BASIC_MOTOR_RB_PIN, kPORT_MuxAlt4);

    /* PORTC3 (pin 106) is configured as FTM0_CH2 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_LA_PORT, RTEPIN_BASIC_MOTOR_LA_PIN, kPORT_MuxAlt4);

    /* PORTC4 (pin 109) is configured as FTM0_CH3 */
    PORT_SetPinMux(RTEPIN_BASIC_MOTOR_LB_PORT, RTEPIN_BASIC_MOTOR_LB_PIN, kPORT_MuxAlt4);

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_VSNC_PORT, RTEPIN_BASIC_CAM_VSNC_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_0_PORT, RTEPIN_BASIC_CAM_D_0_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 114) is configured as PTC9 */
    PORT_SetPinMux(RTEPIN_BASIC_CAM_D_1_PORT, RTEPIN_BASIC_CAM_D_1_PIN, kPORT_MuxAsGpio);

    /* PORTD12 (pin 141) is configured as SPI2_SCK */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_SCK_PORT, RTEPIN_BASIC_OLED_SCK_PIN, kPORT_MuxAlt2);

    /* PORTD13 (pin 142) is configured as SPI2_SOUT */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_SOT_PORT, RTEPIN_BASIC_OLED_SOT_PIN, kPORT_MuxAlt2);

    /* PORTD14 (pin 143) is configured as PTD14 */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_RST_PORT, RTEPIN_BASIC_OLED_RST_PIN, kPORT_MuxAsGpio);

    /* PORTD15 (pin 144) is configured as PTD15 */
    PORT_SetPinMux(RTEPIN_BASIC_OLED_D_C_PORT, RTEPIN_BASIC_OLED_D_C_PIN, kPORT_MuxAsGpio);

    /* PORTD8 (pin 137) is configured as I2C0_SCL */
    PORT_SetPinMux(RTEPIN_BASIC_IMU_SCL_PORT, RTEPIN_BASIC_IMU_SCL_PIN, kPORT_MuxAlt2);

    PORTD->PCR[8] = ((PORTD->PCR[8] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTD9 (pin 138) is configured as I2C0_SDA */
    PORT_SetPinMux(RTEPIN_BASIC_IMU_SDA_PORT, RTEPIN_BASIC_IMU_SDA_PIN, kPORT_MuxAlt2);

    PORTD->PCR[9] = ((PORTD->PCR[9] &
                      /* Mask bits to zero which are setting */
                      (~(PORT_PCR_PS_MASK | PORT_PCR_PE_MASK | PORT_PCR_ODE_MASK | PORT_PCR_ISF_MASK)))

                     /* Pull Select: Internal pullup resistor is enabled on the corresponding pin, if the
                      * corresponding PE field is set. */
                     | (uint32_t)(kPORT_PullUp)

                     /* Open Drain Enable: Open drain output is enabled on the corresponding pin, if the pin is
                      * configured as a digital output. */
                     | PORT_PCR_ODE(kPORT_OpenDrainEnable));

    /* PORTE0 (pin 1) is configured as SDHC0_D1 */
    PORT_SetPinMux(RTEPIN_BASIC_SD_D_1_PORT, RTEPIN_BASIC_SD_D_1_PIN, kPORT_MuxAlt4);

    /* PORTE1 (pin 2) is configured as SDHC0_D0 */
    PORT_SetPinMux(RTEPIN_BASIC_SD_D_0_PORT, RTEPIN_BASIC_SD_D_0_PIN, kPORT_MuxAlt4);

    /* PORTE10 (pin 13) is configured as PTE10 */
    PORT_SetPinMux(RTEPIN_BASIC_BUTTON_UP_PORT, RTEPIN_BASIC_BUTTON_UP_PIN, kPORT_MuxAsGpio);

