CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_MCUX/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : RTEPIN_Digital
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void RTEPIN_Digital(void)
{
    /* Port A Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);
    /* Port C Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortC);
    /* Port E Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortE);

    /* PORTA0 (pin 50) is configured as JTAG_TCLK */
    PORT_SetPinMux(RTEPIN_DIGITAL_SWO_CLK_PORT, RTEPIN_DIGITAL_SWO_CLK_PIN, kPORT_MuxAlt7);

    /* PORTA11 (pin 63) is configured as PTA11 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SWITCH_1_PORT, RTEPIN_DIGITAL_SWITCH_1_PIN, kPORT_MuxAsGpio);

    /* PORTA13 (pin 65) is configured as PTA13 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SWITCH_2_PORT, RTEPIN_DIGITAL_SWITCH_2_PIN, kPORT_MuxAsGpio);

    /* PORTA15 (pin 67) is configured as PTA15 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SWITCH_3_PORT, RTEPIN_DIGITAL_SWITCH_3_PIN, kPORT_MuxAsGpio);

    /* PORTA3 (pin 53) is configured as JTAG_TMS */
    PORT_SetPinMux(RTEPIN_DIGITAL_SWO_DIO_PORT, RTEPIN_DIGITAL_SWO_DIO_PIN, kPORT_MuxAlt7);

    /* PORTA9 (pin 61) is configured as PTA9 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SWITCH_0_PORT, RTEPIN_DIGITAL_SWITCH_0_PIN, kPORT_MuxAsGpio);

    /* PORTB0 (pin 81) is configured as FTM1_QD_PHA */
    PORT_SetPinMux(RTEPIN_DIGITAL_ENCO_LA_PORT, RTEPIN_DIGITAL_ENCO_LA_PIN, kPORT_MuxAlt6);

    /* PORTB1 (pin 82) is configured as FTM1_QD_PHB */
    PORT_SetPinMux(RTEPIN_DIGITAL_ENCO_LB_PORT, RTEPIN_DIGITAL_ENCO_LB_PIN, kPORT_MuxAlt6);

    /* PORTB18 (pin 97) is configured as FTM2_QD_PHA */
    PORT_SetPinMux(RTEPIN_DIGITAL_ENCO_RA_PORT, RTEPIN_DIGITAL_ENCO_RA_PIN, kPORT_MuxAlt6);

    /* PORTB19 (pin 98) is configured as FTM2_QD_PHB */
    PORT_SetPinMux(RTEPIN_DIGITAL_ENCO_RB_PORT, RTEPIN_DIGITAL_ENCO_RB_PIN, kPORT_MuxAlt6);

    /* PORTC10 (pin 115) is configured as PTC10 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_2_PORT, RTEPIN_DIGITAL_CAM_D_2_PIN, kPORT_MuxAsGpio);

    /* PORTC11 (pin 116) is configured as PTC11 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_3_PORT, RTEPIN_DIGITAL_CAM_D_3_PIN, kPORT_MuxAsGpio);

    /* PORTC12 (pin 117) is configured as PTC12 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_4_PORT, RTEPIN_DIGITAL_CAM_D_4_PIN, kPORT_MuxAsGpio);

    /* PORTC13 (pin 118) is configured as PTC13 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_5_PORT, RTEPIN_DIGITAL_CAM_D_5_PIN, kPORT_MuxAsGpio);

    /* PORTC14 (pin 119) is configured as PTC14 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_6_PORT, RTEPIN_DIGITAL_CAM_D_6_PIN, kPORT_MuxAsGpio);

    /* PORTC15 (pin 120) is configured as PTC15 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_7_PORT, RTEPIN_DIGITAL_CAM_D_7_PIN, kPORT_MuxAsGpio);

    /* PORTC18 (pin 125) is configured as PTC18 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_PCLK_PORT, RTEPIN_DIGITAL_CAM_PCLK_PIN, kPORT_MuxAsGpio);

    /* PORTC6 (pin 111) is configured as PTC6 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_VSNC_PORT, RTEPIN_DIGITAL_CAM_VSNC_PIN, kPORT_MuxAsGpio);

    /* PORTC8 (pin 113) is configured as PTC8 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_0_PORT, RTEPIN_DIGITAL_CAM_D_0_PIN, kPORT_MuxAsGpio);

    /* PORTC9 (pin 114) is configured as PTC9 */
    PORT_SetPinMux(RTEPIN_DIGITAL_CAM_D_1_PORT, RTEPIN_DIGITAL_CAM_D_1_PIN, kPORT_MuxAsGpio);

    /* PORTE0 (pin 1) is configured as SDHC0_D1 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_D_1_PORT, RTEPIN_DIGITAL_SD_D_1_PIN, kPORT_MuxAlt4);

    /* PORTE1 (pin 2) is configured as SDHC0_D0 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_D_0_PORT, RTEPIN_DIGITAL_SD_D_0_PIN, kPORT_MuxAlt4);

    /* PORTE10 (pin 13) is configured as PTE10 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BUTTON_UP_PORT, RTEPIN_DIGITAL_BUTTON_UP_PIN, kPORT_MuxAsGpio);

    /* PORTE11 (pin 14) is configured as PTE11 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BUTTON_DN_PORT, RTEPIN_DIGITAL_BUTTON_DN_PIN, kPORT_MuxAsGpio);

    /* PORTE12 (pin 15) is configured as FTM3_CH7 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SERVO_0_PORT, RTEPIN_DIGITAL_SERVO_0_PIN, kPORT_MuxAlt6);

    /* PORTE2 (pin 3) is configured as SDHC0_DCLK */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_CLK_PORT, RTEPIN_DIGITAL_SD_CLK_PIN, kPORT_MuxAlt4);

    /* PORTE3 (pin 4) is configured as SDHC0_CMD */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_CMD_PORT, RTEPIN_DIGITAL_SD_CMD_PIN, kPORT_MuxAlt4);

    /* PORTE4 (pin 7) is configured as SDHC0_D3 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_D_3_PORT, RTEPIN_DIGITAL_SD_D_3_PIN, kPORT_MuxAlt4);

    /* PORTE5 (pin 8) is configured as SDHC0_D2 */
    PORT_SetPinMux(RTEPIN_DIGITAL_SD_D_2_PORT, RTEPIN_DIGITAL_SD_D_2_PIN, kPORT_MuxAlt4);

    /* PORTE7 (pin 10) is configured as PTE7 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BUTTON_OK_PORT, RTEPIN_DIGITAL_BUTTON_OK_PIN, kPORT_MuxAsGpio);

    /* PORTE8 (pin 11) is configured as PTE8 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BUTTON_LF_PORT, RTEPIN_DIGITAL_BUTTON_LF_PIN, kPORT_MuxAsGpio);

    /* PORTE9 (pin 12) is configured as PTE9 */
    PORT_SetPinMux(RTEPIN_DIGITAL_BUTTON_RT_PORT, RTEPIN_DIGITAL_BUTTON_RT_PIN, kPORT_MuxAsGpio);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
RTEPIN_Analog:
- options: {callFromInitBoot: 'false', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '36', peripheral: ADC0, signal: 'SE, 16', pin_signal: ADC0_SE16/CMP1_IN2/ADC0_SE21}
  - {pin_num: '38', peripheral: ADC0, signal: 'SE, 23', pin_signal: DAC0_OUT/CMP1_IN3/ADC0_SE23}
  - {pin_num: '45', peripheral: ADC0, signal: 'SE, 17', pin_signal: ADC0_SE17/PTE24/CAN1_TX/UART4_TX/I2C0_SCL/EWM_OUT_b}
  - {pin_num: '46', peripheral: ADC0, signal: 'SE, 18', pin_signal: ADC0_SE18/PTE25/LLWU_P21/CAN1_RX/UART4_RX/I2C0_SDA/EWM_IN}
  - {pin_num: '59', peripheral: ADC0, signal: 'SE, 10', pin_signal: ADC0_SE10/PTA7/FTM0_CH4/RMII0_MDIO/MII0_MDIO/TRACE_D3}
  - {pin_num: '60', peripheral: ADC0, signal: 'SE, 11', pin_signal: ADC0_SE11/PTA8/FTM1_CH0/RMII0_MDC/MII0_MDC/FTM1_QD_PHA/TPM1_CH0/TRACE_D2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

